#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fleek/ursa-testnet/runs/run-38junkQZYVRaMDuT

Waiting for the plan to start...

Terraform v1.2.6
on linux_amd64
Initializing plugins and modules...
digitalocean_project.ursa: Refreshing state... [id=32d57b4f-d866-4735-8d5e-671631cdf9ae]
digitalocean_project_resources.project_resources["ams3"]: Refreshing state... [id=32d57b4f-d866-4735-8d5e-671631cdf9ae]
digitalocean_kubernetes_cluster.ursa_cluster["ams3"]: Refreshing state... [id=b8bfc668-0d8e-478f-9505-3aa68d1fea4b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # digitalocean_firewall.ursa_peering will be created
  + resource "digitalocean_firewall" "ursa_peering" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + name            = "ursa-peering"
      + pending_changes = (known after apply)
      + status          = (known after apply)
      + tags            = [
          + "ursa-bootstrap",
          + "ursa-main",
        ]

      + inbound_rule {
          + port_range                = "6009"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "6009"
          + protocol                  = "udp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }

      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "6009"
          + protocol                       = "tcp"
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "6009"
          + protocol                       = "udp"
        }
    }

  # digitalocean_project_resources.project_resources["ams3"] will be destroyed
  # (because digitalocean_project_resources.project_resources is not in configuration)
  - resource "digitalocean_project_resources" "project_resources" {
      - id        = "32d57b4f-d866-4735-8d5e-671631cdf9ae" -> null
      - project   = "32d57b4f-d866-4735-8d5e-671631cdf9ae" -> null
      - resources = [] -> null
    }

  # module.k8s_apps_ams3.digitalocean_kubernetes_cluster.ursa_cluster will be created
  + resource "digitalocean_kubernetes_cluster" "ursa_cluster" {
      + cluster_subnet = (known after apply)
      + created_at     = (known after apply)
      + endpoint       = (known after apply)
      + ha             = false
      + id             = (known after apply)
      + ipv4_address   = (known after apply)
      + kube_config    = (sensitive value)
      + name           = "ursa-ams3"
      + region         = "ams3"
      + service_subnet = (known after apply)
      + status         = (known after apply)
      + surge_upgrade  = true
      + updated_at     = (known after apply)
      + urn            = (known after apply)
      + version        = "1.23.9-do.0"
      + vpc_uuid       = (known after apply)

      + maintenance_policy {
          + day        = (known after apply)
          + duration   = (known after apply)
          + start_time = (known after apply)
        }

      + node_pool {
          + actual_node_count = (known after apply)
          + auto_scale        = true
          + id                = (known after apply)
          + max_nodes         = 6
          + min_nodes         = 3
          + name              = "ursa-main"
          + nodes             = (known after apply)
          + size              = "s-2vcpu-4gb"
          + tags              = [
              + "ursa-main",
            ]
        }
    }

  # module.k8s_apps_ams3.digitalocean_kubernetes_node_pool.bootstrap_pool will be created
  + resource "digitalocean_kubernetes_node_pool" "bootstrap_pool" {
      + actual_node_count = (known after apply)
      + auto_scale        = false
      + cluster_id        = (known after apply)
      + id                = (known after apply)
      + name              = "ursa-bootstrap"
      + node_count        = 2
      + nodes             = (known after apply)
      + size              = "s-2vcpu-4gb"
      + tags              = [
          + "ursa-bootstrap",
        ]
    }

  # module.k8s_apps_ams3.digitalocean_project_resources.project_resources will be created
  + resource "digitalocean_project_resources" "project_resources" {
      + id        = (known after apply)
      + project   = "32d57b4f-d866-4735-8d5e-671631cdf9ae"
      + resources = (known after apply)
    }

  # module.k8s_apps_ams3.kubernetes_daemonset.ursa_bootstrap_node will be created
  + resource "kubernetes_daemonset" "ursa_bootstrap_node" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + name             = "ursa-bootstrap-node"
          + namespace        = "ursa"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds      = 0
          + revision_history_limit = 10

          + selector {
              + match_labels = {
                  + "app" = "UrsaBootstrapNode"
                }
            }

          + strategy {
              + type = "RollingUpdate"

              + rolling_update {
                  + max_unavailable = "1"
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "UrsaBootstrapNode"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }

              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + affinity {
                      + node_affinity {

                          + required_during_scheduling_ignored_during_execution {
                              + node_selector_term {
                                  + match_expressions {
                                      + key      = "doks.digitalocean.com/node-pool"
                                      + operator = "In"
                                      + values   = [
                                          + "ursa-bootstrap",
                                        ]
                                    }
                                }
                            }
                        }
                    }

                  + container {
                      + image                      = "ghcr.io/psychedelic/ursa:latest"
                      + image_pull_policy          = (known after apply)
                      + name                       = "ursa"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + liveness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 3
                          + period_seconds        = 3
                          + success_threshold     = 1
                          + timeout_seconds       = 1

                          + http_get {
                              + path   = "/"
                              + port   = "80"
                              + scheme = "HTTP"

                              + http_header {
                                  + name  = "X-Custom-Header"
                                  + value = "Awesome"
                                }
                            }
                        }

                      + port {
                          + container_port = 4069
                          + protocol       = "TCP"
                        }
                      + port {
                          + container_port = 6009
                          + host_port      = 6009
                          + protocol       = "TCP"
                        }
                      + port {
                          + container_port = 6009
                          + host_port      = 6009
                          + protocol       = "UDP"
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "2048"
                              + "memory" = "4096Mi"
                            }
                          + requests = (known after apply)
                        }

                      + volume_mount {
                          + mount_path        = "/app/ursa_db"
                          + mount_propagation = "None"
                          + name              = "localfs"
                          + read_only         = false
                        }
                    }

                  + image_pull_secrets {
                      + name = "dockerconfigjson"
                    }

                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  + volume {
                      + name = "localfs"

                      + host_path {
                          + path = "/opt/ursa"
                        }
                    }
                }
            }
        }
    }

  # module.k8s_apps_ams3.kubernetes_daemonset.ursa_node will be created
  + resource "kubernetes_daemonset" "ursa_node" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + name             = "ursa-node"
          + namespace        = "ursa"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds      = 0
          + revision_history_limit = 10

          + selector {
              + match_labels = {
                  + "app" = "UrsaNode"
                }
            }

          + strategy {
              + type = "RollingUpdate"

              + rolling_update {
                  + max_unavailable = "1"
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "UrsaNode"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }

              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + affinity {
                      + node_affinity {

                          + required_during_scheduling_ignored_during_execution {
                              + node_selector_term {
                                  + match_expressions {
                                      + key      = "doks.digitalocean.com/node-pool"
                                      + operator = "In"
                                      + values   = [
                                          + "ursa-main",
                                        ]
                                    }
                                }
                            }
                        }
                    }

                  + container {
                      + image                      = "ghcr.io/psychedelic/ursa:latest"
                      + image_pull_policy          = (known after apply)
                      + name                       = "ursa"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + liveness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 3
                          + period_seconds        = 3
                          + success_threshold     = 1
                          + timeout_seconds       = 1

                          + http_get {
                              + path   = "/"
                              + port   = "80"
                              + scheme = "HTTP"

                              + http_header {
                                  + name  = "X-Custom-Header"
                                  + value = "Awesome"
                                }
                            }
                        }

                      + port {
                          + container_port = 4069
                          + protocol       = "TCP"
                        }
                      + port {
                          + container_port = 6009
                          + host_port      = 6009
                          + protocol       = "TCP"
                        }
                      + port {
                          + container_port = 6009
                          + host_port      = 6009
                          + protocol       = "UDP"
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "2048"
                              + "memory" = "4096Mi"
                            }
                          + requests = (known after apply)
                        }

                      + volume_mount {
                          + mount_path        = "/app/ursa_db"
                          + mount_propagation = "None"
                          + name              = "localfs"
                          + read_only         = false
                        }
                    }

                  + image_pull_secrets {
                      + name = "dockerconfigjson"
                    }

                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  + volume {
                      + name = "localfs"

                      + host_path {
                          + path = "/opt/ursa"
                        }
                    }
                }
            }
        }
    }

  # module.k8s_apps_ams3.kubernetes_namespace.ursa will be created
  + resource "kubernetes_namespace" "ursa" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ursa"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.k8s_apps_ams3.kubernetes_secret.dockerconfigjson will be created
  + resource "kubernetes_secret" "dockerconfigjson" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "kubernetes.io/dockerconfigjson"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "docker-cfg"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 8 to add, 0 to change, 1 to destroy.


```
</details>
*Pushed by: @b0xtch, Action: `pull_request`*